import React from 'react'
import { Metadata } from "next";
import CostCenter from '@/app/PagesData/CostCenter';

export const generateMetadata = (): Metadata => {
    return {
        title: "نظام مراكز التكلفة في الترا لحلول الأعمال – الحل المثالي لتحليل التكاليف وتحسين الأداء المالي",
        description: "نظام مراكز التكلفة في الترا لحلول الأعمال يساعد الشركات على تتبع وتحليل التكاليف بدقة داخل المؤسسة. يوفر تقارير تحليلية شاملة ويسهم في تحسين الاستراتيجيات المالية, مما يعزز الكفاءة المالية ويحقق أقصى استفادة من الموارد المتاحة.",
        keywords:"نظام مراكز التكلفة, مراكز التكلفة, تحليل التكاليف, تقارير مالية, تحسين الأداء المالي, إدارة التكاليف, المحاسبة الإدارية, تخصيص التكاليف, تحسين الربحية, اتخاذ قرارات مالية, تكاليف التشغيل, توزيع الموارد, موازنات تقديرية, استراتيجيات التسعير, Cost Center Management, Best Cost Management System, Cost Analysis Solutions, Financial Performance Optimization",
        openGraph: {
          title: "نظام مراكز التكلفة في الترا لحلول الأعمال – الحل المثالي لتحليل التكاليف وتحسين الأداء المالي",
          description: "نظام مراكز التكلفة في الترا لحلول الأعمال يساعد الشركات على تتبع وتحليل التكاليف بدقة داخل المؤسسة. يوفر تقارير تحليلية شاملة ويسهم في تحسين الاستراتيجيات المالية, مما يعزز الكفاءة المالية ويحقق أقصى استفادة من الموارد المتاحة.",
          type: "website",
        },
      };
};

const page = () => {
  return (
    <div>
       <CostCenter/>
    </div>
  )
}

export default page