import InventoryModule from "@/app/PagesData/InventoryModule";
import { Metadata } from "next";

export const generateMetadata = (): Metadata => {
    return {
        title: "نظام المخازن في الترا لحلول الأعمال – الحل الشامل لإدارة المستودعات",
        description: "نظام المخازن في الترا لحلول الأعمال يقدم حلولًا متكاملة لإدارة المخزون والمستودعات بكفاءة. تتبع حركة البضائع بدقة, إدارة المخازن المتعددة, دعم الباركود, وتحليل المخزون لتقليل التكاليف وزيادة الكفاءة التشغيلية.",
        keywords:"نظام المخازن, إدارة المخزون, أفضل برنامج لإدارة المخزون, برنامج إدارة المخازن, تتبع البضائع, تقارير المخزون, إدارة المستودعات, الجرد, باركود, المخازن المتعددة, إدارة الموردين, تقارير الجرد, حسابات المخزون, سياسة التسعير, إدارة العملاء, حسابات بنكية, تسوية الجرد, Inventory Management, Best Inventory System, Multi Store System, Stock Management Software, Warehouse Management Solutions ",
        openGraph: {
          title: "نظام المخازن في الترا لحلول الأعمال – الحل الشامل لإدارة المستودعات",
          description: "نظام المخازن في الترا لحلول الأعمال يقدم حلولًا متكاملة لإدارة المخزون والمستودعات بكفاءة. تتبع حركة البضائع بدقة, إدارة المخازن المتعددة, دعم الباركود, وتحليل المخزون لتقليل التكاليف وزيادة الكفاءة التشغيلية.",
          type: "website",
        },
      };
};
const page = () => {
  return (
    <div>

       <InventoryModule/>
    </div>
  )
}

export default page