import ManufacturingModule from "@/app/PagesData/ManufacturingModule";
import { Metadata } from "next";

export const generateMetadata = (): Metadata => {
    return {
        title: "نظام إدارة التصنيع – تحكم كامل في عمليات الإنتاج",
        description: "نظام إدارة التصنيع في الترا لحلول الأعمال يقدم تحكمًا كاملاً في جميع مراحل الإنتاج, من التخطيط حتى حساب التكاليف وإدارة المخزون. يعزز النظام الكفاءة التشغيلية ويقلل التكاليف عبر أتمتة العمليات وتحليل البيانات لاتخاذ قرارات استراتيجية دقيقة.",
        keywords:"نظام إدارة التصنيع, إدارة التصنيع, أفضل برنامج للتصنيع, برنامج إدارة التصنيع, تحسين الإنتاجية, تخطيط الإنتاج, حساب تكاليف التصنيع, تقارير التصنيع, إدارة المخزون, تقارير التكاليف, تقارير الإنتاج, تحسين جودة المنتج, أتمتة التصنيع, مراقبة سير العمل, تقارير مالية, تقارير الأرباح والخسائر, Manufacturing Management, Best Manufacturing Software, ERP Manufacturing Solutions, Production Management ",
        openGraph: {
          title: "نظام إدارة التصنيع – تحكم كامل في عمليات الإنتاج",
          description: "نظام إدارة التصنيع في الترا لحلول الأعمال يقدم تحكمًا كاملاً في جميع مراحل الإنتاج, من التخطيط حتى حساب التكاليف وإدارة المخزون. يعزز النظام الكفاءة التشغيلية ويقلل التكاليف عبر أتمتة العمليات وتحليل البيانات لاتخاذ قرارات استراتيجية دقيقة.",
          type: "website",
        },
      };
};
const page = () => {
  return (
    <div>
       <ManufacturingModule/>
    </div>
  )
}

export default page