import Management from "@/app/PagesData/Management";
import { Metadata } from "next";

export const generateMetadata = (): Metadata => {
    return {
        title: "إدارة وربط الفروع – حلول متكاملة لربط أعمالك بسهولة وكفاءة",
        description: "يقدم الترا لحلول الأعمال نظامًا متكاملًا لإدارة وربط الفروع عبر الإنترنت, مما يتيح لك التحكم في جميع جوانب عملك من أي مكان وبكفاءة عالية. مع ضمان استمرارية العمل حتى في حالة انقطاع الاتصال, ودون الحاجة إلى استثمارات ضخمة في الأجهزة أو البنية التحتية.",
        keywords:"إدارة الفروع, ربط الفروع, ربط الفروع عبر الإنترنت, نظام إدارة الفروع, إدارة البيانات المركزية, تكامل الفروع, إدارة المخزون, تحسين الأداء, أمان البيانات, استمرارية العمل, مزامنة البيانات, تكنولوجيا العمل عبر الإنترنت, إدارة المبيعات, Branch Management, Best Branch Management System, Cloud-based Branch Solutions, Business Continuity, Data Synchronization",
        openGraph: {
          title: "إدارة وربط الفروع – حلول متكاملة لربط أعمالك بسهولة وكفاءة",
          description: "يقدم الترا لحلول الأعمال نظامًا متكاملًا لإدارة وربط الفروع عبر الإنترنت, مما يتيح لك التحكم في جميع جوانب عملك من أي مكان وبكفاءة عالية. مع ضمان استمرارية العمل حتى في حالة انقطاع الاتصال, ودون الحاجة إلى استثمارات ضخمة في الأجهزة أو البنية التحتية.",
          type: "website",
        },
      };
};
const page = () => {
  return (
    <div>

       <Management/>
    </div>
  )
}

export default page