import SalesModule from "@/app/PagesData/SalesModule";
import { Metadata } from "next";

export const generateMetadata = (): Metadata => {
    return {
        title: "عزّز مبيعاتك وحلل أدائك بذكاء مع أفضل نظام إدارة المبيعات",
        description: "نظام إدارة المبيعات من الترا لحلول الأعمال يتيح لك التحكم الكامل في دورة المبيعات, من إصدار الفواتير إلى متابعة الدفعات. يوفر تقارير تفصيلية تساعدك في تحليل الأداء وزيادة المبيعات بذكاء. يتكامل مع أنظمة المحاسبة والمخازن لتحقيق أعلى كفاءة.",
        keywords:"نظام إدارة المبيعات, إدارة المبيعات, برنامج إدارة المبيعات, أفضل برنامج مبيعات, تحليلات المبيعات, تقارير المبيعات, فواتير مبيعات, تتبع المعاملات, تحسين المبيعات, عروض الأسعار, تقارير مالية, نظام محاسبي, إدارة الفروع, الفواتير الإلكترونية, تقارير تفاعلية, كشف الحساب, ربط المرتجعات, Sales Management System, Sales Optimization, Best Sales Software, Sales Analytics, Business Sales Solutions",
        openGraph: {
          title: "عزّز مبيعاتك وحلل أدائك بذكاء مع أفضل نظام إدارة المبيعات",
          description: "نظام إدارة المبيعات من الترا لحلول الأعمال يتيح لك التحكم الكامل في دورة المبيعات, من إصدار الفواتير إلى متابعة الدفعات. يوفر تقارير تفصيلية تساعدك في تحليل الأداء وزيادة المبيعات بذكاء. يتكامل مع أنظمة المحاسبة والمخازن لتحقيق أعلى كفاءة.",
          type: "website",
        },
      };
    }

const page = () => {
  return (
    <div>

      <SalesModule/>
    </div>
  )
}

export default page