import UltraBusinessSolutions from "@/app/PagesData/UltraBusinessSolutions";
import { Metadata } from "next";

export const generateMetadata = (): Metadata => {
    return {
        title: "الترا لحلول الأعمال | نظام محاسبي متكامل لتحسين إدارة شركتك المالية",
        description: "نظام الترا لحلول الأعمال هو الحل المثالي لإدارة حساباتك, المخازن, المبيعات, التصنيع, المدفوعات والضرائب بسهولة. أنظمة متكاملة تضمن لك تحكمًا كاملاً في عملياتك المالية والإدارية لتحقيق نمو مستدام لعملك.",
        keywords:"أفضل برنامج حسابات, حلول محاسبية, نظام محاسبي متكامل, إدارة الحسابات, إدارة المبيعات, إدارة المخازن, نظام التصنيع, الأوراق المالية, البنوك, الشيكات, أنماط الفواتير, أنماط السندات, إدارة المدفوعات, الفاتورة الإلكترونية, ربط الفروع, دعم فني, تحديثات مستمرة, برامج محاسبية, نقطة بيع, POS, Best ERP Solutions, Business Management Software, Financial Automation, Enterprise Solutions ",
        openGraph: {
          title: "الترا لحلول الأعمال | نظام محاسبي متكامل لتحسين إدارة شركتك المالية",
          description: "نظام الترا لحلول الأعمال هو الحل المثالي لإدارة حساباتك, المخازن, المبيعات, التصنيع, المدفوعات والضرائب بسهولة. أنظمة متكاملة تضمن لك تحكمًا كاملاً في عملياتك المالية والإدارية لتحقيق نمو مستدام لعملك.",
          type: "website",
        },
      };
};
const page = () => {
  return (
    <div>
       <UltraBusinessSolutions/>
    </div>
  )
}

export default page