import RecordsAndSecurities from "@/app/PagesData/RecordsAndSecurities";
import { Metadata } from "next";

export const generateMetadata = (): Metadata => {
    return {
        title: "نظام إدارة المدفوعات والأوراق المالية في الترا لحلول الأعمال – حلول متكاملة لتحكم مالي أكثر كفاءة",
        description: "نظام إدارة المدفوعات والأوراق المالية في الترا لحلول الأعمال يساعد الشركات على تحسين التدفق النقدي, وتقليل المخاطر المالية, وتسجيل المعاملات بدقة. يقدم نظامًا متكاملًا لإدارة المدفوعات بكافة أنواعها وتتبع الأوراق المالية بطريقة منظمة, مما يسهل المحاسبة ويضمن الامتثال للمعايير المالية.",
        keywords:"إدارة المدفوعات, الأوراق المالية, المدفوعات النقدية, الشيكات, الحوالات البنكية, السندات, الكمبيالات, التدفق النقدي, المحاسبة المالية, تقارير مالية, إدارة المعاملات, التذكير بالاستحقاقات, أتمتة المدفوعات, تقارير المدفوعات اليومية, تحكم مالي, Payment Management, Best Payment Software, Financial Transactions, Cash Flow Management, Payment Automation, Business Payment Solutions",
        openGraph: {
          title: "نظام إدارة المدفوعات والأوراق المالية في الترا لحلول الأعمال – حلول متكاملة لتحكم مالي أكثر كفاءة",
          description: "نظام إدارة المدفوعات والأوراق المالية في الترا لحلول الأعمال يساعد الشركات على تحسين التدفق النقدي, وتقليل المخاطر المالية, وتسجيل المعاملات بدقة. يقدم نظامًا متكاملًا لإدارة المدفوعات بكافة أنواعها وتتبع الأوراق المالية بطريقة منظمة, مما يسهل المحاسبة ويضمن الامتثال للمعايير المالية.",
          type: "website",
        },
      };
};
const page = () => {
  return (
    <div>

       <RecordsAndSecurities/>
    </div>
  )
}

export default page